import { IDeal } from '../../schema/Deal'

const parseNotes = (row: IDeal) => {
  const notesForbid = ["公共設施保留地之交易", "公共設施保留地", "公共設施",
    "公共設施交易", "公共設施",
    "受債權債務影響或債務抵償之交易", "債權債務", "債權", "債務", "抵償", "債務抵償",
    "向政府機關承購之案件", "政府機關承購", "政府機關",
    "土地及建物分次登記案件", "分次登記", "分次",
    "建商地主合建案", "建商地主",
    "急買急賣", "急買", "急賣",
    "有夾層", "夾層",
    "有民情風俗因素之交易", "民情風俗", "民情", "風俗",
    "法拍屋", "法拍",
    "瑕疵物件之交易", "瑕疵物件", "瑕疵",
    "畸零地及合併使用之交易", "畸零地", "合併使用",
    "親友關係人交易", "親友關係人", "親友", "關係人",
    "賣清買清(稅費議定誰負擔)", "賣清買清", "賣清", "買清",
    "農地交易(興建農舍_375租約)", "375租約", "農地交易", "農地", "農舍"]

  notesForbid.forEach((forbid) => {
    if (row.notes.includes(forbid)) {

    }
  })
}

export default parseNotes
