import { readCsvFile } from './io'
import { IDeal } from './schema/Deal'
// {
//   '': '0',
//   '編號': 'RPVNMLNJJHIFFGH28CA',
//   '非都市土地使用分區': 'nan',
//   '土地交易筆數': '2',
//   '建物交易筆數': '0',
//   '車位交易筆數': '0',
//   '總樓層數': '0',
//   '主要建材': 'nan',
//   '交易標的': '土地',
//   '非都市土地使用編定': 'nan',
//   '交易年月日': '1010102',
//   '建築完成年月': 'nan',
//   '移轉層次': 'nan',
//   '解析移轉層次': '0',
//   '建物型態': '其他',
//   '車位類別': 'nan',
//   '主要用途': 'nan',
//   '土地位置/建物門牌': '平鎮段827地號',
//   '都市土地使用分區': '其他',
//   '鄉鎮市區': '平鎮區',
//   '備註': '本案交易總價包含收件字號平資字第035260號、平資字第182700~182710號之土地交易。',
//   '建物移轉總面積(平方公尺)': '0.0',
//   '土地移轉總面積(平方公尺)': '1392.08',
//   '主建物面積': '0.0',
//   '車位移轉總面積(平方公尺)': '0.0',
//   '附屬建物面積': '0.0',
//   '車位總價(元)': '0',
//   '陽台面積': '0.0',
//   '總價(元)': '17000000',
//   '單價(元/平方公尺)': '12211.94184242285',
//   '建物現況格局-衛': '0',
//   '建物現況格局-房': '0',
//   '建物現況格局-廳': '0',
//   '有無管理組織': 'False',
//   '建物現況格局-隔間': 'True',
//   '電梯': 'False',
//   '交易標的橫坐標': '2755133',
//   '交易標的縱坐標': '269351'
// }


(async () => {
  // const data = await readCsvFile<IDeal>('./repository/test.csv')
  // console.log(data[0])
  console.log('aa')
})()
